PayPalAPISoapBinding.BMCreateButton.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:ns2="urn:ebay:apis:CoreComponentTypes"
    xmlns:ns4="urn:ebay:apis:EnhancedDataTypes"
    xmlns:ns3="urn:ebay:apis:eBLBaseComponents"
    xmlns:ns1="urn:ebay:api:PayPalAPI">
 <SOAP-ENV:Header>
  <ns1:RequesterCredentials>
   <ns3:eBayAuthToken></ns3:eBayAuthToken>
   <ns3:HardExpirationWarning></ns3:HardExpirationWarning>
   <ns3:Credentials>
    <ns3:AppId></ns3:AppId>
    <ns3:DevId></ns3:DevId>
    <ns3:AuthCert></ns3:AuthCert>
    <ns3:Username></ns3:Username>
    <ns3:Password></ns3:Password>
    <ns3:Signature></ns3:Signature>
    <ns3:Subject></ns3:Subject>
    <ns3:AuthToken></ns3:AuthToken>
   </ns3:Credentials>
  </ns1:RequesterCredentials>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
   <ns1:BMCreateButtonReq>
    <ns1:BMCreateButtonRequest>
     <ns1:ButtonType>BUYNOW</ns1:ButtonType>
     <ns1:ButtonCode>HOSTED</ns1:ButtonCode>
     <ns1:ButtonSubType>PRODUCTS</ns1:ButtonSubType>
     <ns1:ButtonVar></ns1:ButtonVar>
     <ns1:ButtonVar></ns1:ButtonVar>
     <ns1:OptionDetails>
      <ns1:OptionName></ns1:OptionName>
      <ns1:OptionSelectionDetails>
       <ns1:OptionSelection></ns1:OptionSelection>
       <ns1:Price></ns1:Price>
       <ns1:OptionType>NoOptionType</ns1:OptionType>
       <ns1:PaymentPeriod>
       </ns1:PaymentPeriod>
       <ns1:PaymentPeriod>
       </ns1:PaymentPeriod>
      </ns1:OptionSelectionDetails>
      <ns1:OptionSelectionDetails>
       <ns1:OptionSelection></ns1:OptionSelection>
       <ns1:Price></ns1:Price>
       <ns1:OptionType>NoOptionType</ns1:OptionType>
       <ns1:PaymentPeriod>
       </ns1:PaymentPeriod>
       <ns1:PaymentPeriod>
       </ns1:PaymentPeriod>
      </ns1:OptionSelectionDetails>
     </ns1:OptionDetails>
     <ns1:OptionDetails>
      <ns1:OptionName></ns1:OptionName>
      <ns1:OptionSelectionDetails>
       <ns1:OptionSelection></ns1:OptionSelection>
       <ns1:Price></ns1:Price>
       <ns1:OptionType>NoOptionType</ns1:OptionType>
       <ns1:PaymentPeriod>
       </ns1:PaymentPeriod>
       <ns1:PaymentPeriod>
       </ns1:PaymentPeriod>
      </ns1:OptionSelectionDetails>
      <ns1:OptionSelectionDetails>
       <ns1:OptionSelection></ns1:OptionSelection>
       <ns1:Price></ns1:Price>
       <ns1:OptionType>NoOptionType</ns1:OptionType>
       <ns1:PaymentPeriod>
       </ns1:PaymentPeriod>
       <ns1:PaymentPeriod>
       </ns1:PaymentPeriod>
      </ns1:OptionSelectionDetails>
     </ns1:OptionDetails>
     <ns1:TextBox></ns1:TextBox>
     <ns1:TextBox></ns1:TextBox>
     <ns1:ButtonImage>REG</ns1:ButtonImage>
     <ns1:ButtonImageURL></ns1:ButtonImageURL>
     <ns1:BuyNowText>BUYNOW</ns1:BuyNowText>
     <ns1:SubscribeText>BUYNOW</ns1:SubscribeText>
     <ns1:ButtonCountry>AF</ns1:ButtonCountry>
     <ns1:ButtonLanguage></ns1:ButtonLanguage>
     <ns1:DetailLevel>ReturnAll</ns1:DetailLevel>
     <ns1:DetailLevel>ReturnAll</ns1:DetailLevel>
     <ns1:ErrorLanguage></ns1:ErrorLanguage>
     <ns1:Version></ns1:Version>
     <!-- extensibility element(s) -->
    </ns1:BMCreateButtonRequest>
   </ns1:BMCreateButtonReq>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
